# Lab 4

In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [2]:
import pandas 
import configparser
import psycopg2

In [3]:
config = configparser.ConfigParser()
config.read('config')

host = config['myaws']['host']
user = config['myaws']['user']
pwsd = config['myaws']['pwsd']
database = config['myaws']['database']

In [4]:
conn = psycopg2.connect(
                         host = host,
                         user = user,
                         password = pwsd,
                         dbname = database
)

In [5]:
cur = conn.cursor()

## Q1

In [6]:
sql_statement = '''
            select * from student_gp15
            '''

In [7]:
cur.execute(sql_statement)

In [8]:
cur.fetchone()

('topacinv@dukes.jmu.edu                                                                              ',
 'Daniel Topacio                                                                                      ',
 'IA                                                                                                  ')

In [9]:
for result in cur.fetchall():
    print (result)

('dovalamm@dukes.jmu.edu                                                                              ', 'Morgan Dovala                                                                                       ', 'IA                                                                                                  ')
('santicm@dukes.jmu.edu                                                                               ', 'Chris Santi                                                                                         ', 'IA                                                                                                  ')
('tobinnc@dukes.jmu.edu                                                                               ', 'Natalie Tobin                                                                                       ', 'GS                                                                                                  ')
('plydr@dukes.jmu.edu                                                                                 ', 'Dylan Ply                                                                                           ', 'IA                                                                                                  ')

In [10]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,major
0,topacinv@dukes.jmu.edu ...,Daniel Topacio ...,IA ...
1,dovalamm@dukes.jmu.edu ...,Morgan Dovala ...,IA ...
2,santicm@dukes.jmu.edu ...,Chris Santi ...,IA ...
3,tobinnc@dukes.jmu.edu ...,Natalie Tobin ...,GS ...
4,plydr@dukes.jmu.edu ...,Dylan Ply ...,IA ...

In [11]:
df.describe()

,email,name,major
count,5,5,5
unique,5,5,2
top,plydr@dukes.jmu.edu ...,Daniel Topacio ...,IA ...
freq,1,1,4

## Q2

In [12]:
sql_statement_2 = '''
                        select
                        cname, count (semail)
                        from enroll_gp15
                        group by cname
                        order by count (cname) desc
                        '''

In [13]:
cur.execute(sql_statement_2)

In [14]:
cur.fetchone()

('IA210                                                                                               ',
 1)

In [15]:
for result in cur.fetchall():
    print (result)

('IA340                                                                                               ', 1)
('IA480                                                                                               ', 1)
('IA460                                                                                               ', 1)
('IA300                                                                                               ', 1)

In [16]:
df = pandas.read_sql_query(sql_statement_2,conn)
df[:]

                                               cname  count
0  IA210                                         ...      1
1  IA340                                         ...      1
2  IA480                                         ...      1
3  IA460                                         ...      1
4  IA300                                         ...      1

All courses have the same number of students enrolled, therefore there is no most enrolled course.

## Q3

In [17]:
sql_statement_3 = '''
            select * from teacher_gp15
            inner join course_gp15
            on teacher_gp15.email = course_gp15.temail
            '''

In [18]:
cur.execute(sql_statement_3)

In [19]:
cur.fetchone()

('weixx@jmu.edu                                                                                       ',
 'Xuebin Wei                                                                                          ',
 'isat112             ',
 'IA340                                                                                               ',
 'engeo2010                                                                                           ',
 'weixx@jmu.edu                                                                                       ')

In [20]:
for result in cur.fetchall():
    print (result)

('waltontr@jmu.edu                                                                                    ', 'Tim Walton                                                                                          ', 'isat326             ', 'IA460                                                                                               ', 'engeo2202                                                                                           ', 'waltontr@jmu.edu                                                                                    ')
('moore8ka@jmu.edu                                                                                    ', 'Kathleen Moore                                                                                      ', 'isat116             ', 'IA480                                                                                               ', 'engeo1209                                                                                           ', 'moore8ka@jmu.edu                                                                                    ')
('taoqx@jmu.edu                                                                                       ', 'Tom Tao                                                                                             ', 'engeo2107           ', 'IA210                                                                                               ', 'isat350                                                                                             ', 'taoqx@jmu.edu                                                                                       ')
('doeja@dukes.jmu.edu                                                                                 ', 'John Doe                                                                                            ', '123                 ', 'IA300                                                                                               ', 'engeo1204                                                                                           ', 'doeja@dukes.jmu.edu                                                                                 ')
('doeja@dukes.jmu.edu                                                                                 ', 'John Doe                                                                                            ', '123                 ', 'John Doe                                                                                            ', '123                                                                                                 ', 'doeja@dukes.jmu.edu                                                                                 ')
('doeja@dukes.jmu.edu                                                                                 ', 'John Doe                                                                                            ', '123                 ', 'IA150                                                                                               ', '123                                                                                                 ', 'doeja@dukes.jmu.edu                                                                                 ')
('doejb@jmu.edu                                                                                       ', 'John Doe2                                                                                           ', 'isat123             ', 'IA101                                                                                               ', 'isat456                                                                                             ', 'doejb@jmu.edu                                                                                       ')

In [21]:
df = pandas.read_sql_query(sql_statement_3,conn)
df[:]

,email,name,office,name,room,temail
0,weixx@jmu.edu ...,Xuebin Wei ...,isat112,IA340 ...,engeo2010 ...,weixx@jmu.edu ...
1,waltontr@jmu.edu ...,Tim Walton ...,isat326,IA460 ...,engeo2202 ...,waltontr@jmu.edu ...
2,moore8ka@jmu.edu ...,Kathleen Moore ...,isat116,IA480 ...,engeo1209 ...,moore8ka@jmu.edu ...
3,taoqx@jmu.edu ...,Tom Tao ...,engeo2107,IA210 ...,isat350 ...,taoqx@jmu.edu ...
4,doeja@dukes.jmu.edu ...,John Doe ...,123,IA300 ...,engeo1204 ...,doeja@dukes.jmu.edu ...
5,doeja@dukes.jmu.edu ...,John Doe ...,123,John Doe ...,123 ...,doeja@dukes.jmu.edu ...
6,doeja@dukes.jmu.edu ...,John Doe ...,123,IA150 ...,123 ...,doeja@dukes.jmu.edu ...
7,doejb@jmu.edu ...,John Doe2 ...,isat123,IA101 ...,isat456 ...,doejb@jmu.edu ...

## Q4

In [22]:
sql_statement_4 = '''
                    select
                    teacher_gp15.name as tname,
                    count (course_gp15.name) as course_num
                    from teacher_gp15
                    inner join course_gp15
                    on teacher_gp15.email = course_gp15.temail
                    group by teacher_gp15.name
                    '''

In [23]:
cur.execute(sql_statement_4)

In [24]:
cur.fetchone()

('Xuebin Wei                                                                                          ',
 1)

In [25]:
for result in cur.fetchall():
    print (result)

('Kathleen Moore                                                                                      ', 1)
('John Doe                                                                                            ', 3)
('Tim Walton                                                                                          ', 1)
('John Doe2                                                                                           ', 1)
('Tom Tao                                                                                             ', 1)

In [26]:
df = pandas.read_sql_query(sql_statement_4,conn)
df[:]

                                               tname  course_num
0  Xuebin Wei                                    ...           1
1  Kathleen Moore                                ...           1
2  John Doe                                      ...           3
3  Tim Walton                                    ...           1
4  John Doe2                                     ...           1
5  Tom Tao                                       ...           1

## Q5

In [27]:
sql_insert_statement = '''
                        insert into teacher_gp15(email,name,office)
                        values('doejb@jmu.edu','John Doe2', 'isat123')
                        '''.format('doejb@jmu.edu','John Doe2',"isat123")
print(sql_insert_statement)

                        insert into teacher_gp15(email,name,office)
                        values('doejb@jmu.edu','John Doe2', 'isat123')

In [28]:
#cur.execute(sql_insert_statement)

In [29]:
conn.commit()

In [30]:
df = pandas.read_sql_query('''select * from teacher_gp15''',conn)
df[:]

,email,name,office
0,weixx@jmu.edu ...,Xuebin Wei ...,isat112
1,waltontr@jmu.edu ...,Tim Walton ...,isat326
2,moore8ka@jmu.edu ...,Kathleen Moore ...,isat116
3,taoqx@jmu.edu ...,Tom Tao ...,engeo2107
4,John Doe ...,doeja@dukes.jmu.edu ...,None
5,doeja@dukes.jmu.edu ...,John Doe ...,123
6,doejb@jmu.edu ...,John Doe2 ...,isat123

In [31]:
sql_insert_statement2 = '''
                        insert into course_gp15(name,room,temail)
                        values('IA101','isat456', 'doejb@jmu.edu')
                        '''.format('IA101','isat456',"doejb@jmu.edu")
print(sql_insert_statement2)

                        insert into course_gp15(name,room,temail)
                        values('IA101','isat456', 'doejb@jmu.edu')

In [32]:
cur.execute(sql_insert_statement2)

UniqueViolation: duplicate key value violates unique constraint "course_gp15_pkey"
DETAIL:  Key (name)=(IA101                                                                                               ) already exists.

In [ ]:
conn.commit()

In [ ]:
df = pandas.read_sql_query('''select * from course_gp15''',conn)
df[:]

## Q6

In [36]:
sql_insert_statement3 = '''
                        update course_gp15
                        set temail = 'doejb@jmu.edu'
                        where name = 'IA340'
                        '''
print(sql_insert_statement3)

                        update course_gp15
                        set temail = 'doejb@jmu.edu'
                        where name = 'IA340'

In [37]:
cur.execute(sql_insert_statement3)

In [38]:
conn.commit()

In [39]:
df = pandas.read_sql_query('''select * from course_gp15''',conn)
df[:]

,name,room,temail
0,IA460 ...,engeo2202 ...,waltontr@jmu.edu ...
1,IA480 ...,engeo1209 ...,moore8ka@jmu.edu ...
2,IA210 ...,isat350 ...,taoqx@jmu.edu ...
3,IA300 ...,engeo1204 ...,doeja@dukes.jmu.edu ...
4,IA340 ...,engeo2010 ...,doejb@jmu.edu ...
5,John Doe ...,123 ...,doeja@dukes.jmu.edu ...
6,IA150 ...,123 ...,doeja@dukes.jmu.edu ...
7,IA101 ...,isat456 ...,doejb@jmu.edu ...

In [45]:
sql_delete_statement = '''
                        delete from teacher_gp15
                        where email = 'weixx@jmu.edu'
                        '''
print(sql_delete_statement)

                        delete from teacher_gp15
                        where email = 'weixx@jmu.edu'

In [46]:
cur.execute(sql_delete_statement)

In [47]:
conn.commit()

In [48]:
df = pandas.read_sql_query('''select * from teacher_gp15''',conn)
df[:]

,email,name,office
0,waltontr@jmu.edu ...,Tim Walton ...,isat326
1,moore8ka@jmu.edu ...,Kathleen Moore ...,isat116
2,taoqx@jmu.edu ...,Tom Tao ...,engeo2107
3,John Doe ...,doeja@dukes.jmu.edu ...,None
4,doeja@dukes.jmu.edu ...,John Doe ...,123
5,doejb@jmu.edu ...,John Doe2 ...,isat123